-- 创建 user 表
CREATE TABLE user (
    -- 姓名，使用 VARCHAR 类型，最大长度为 50
                      name VARCHAR(50) NOT NULL,
    -- 座位号，使用 VARCHAR 类型，最大长度为 20，可包含字母
                      seatNumber VARCHAR(20) NOT NULL,
    -- 登录状态，使用 TINYINT 类型，0 表示未登录，1 表示已登录
                      status TINYINT NOT NULL DEFAULT 0,
    -- 设置座位号为唯一键，确保每个座位号只能对应一个用户
                      UNIQUE (seatNumber)
);


INSERT INTO user (seatNumber, name, status) VALUES
('A1', '', 0), ('A2', '', 0), ('A3', '', 0), ('A4', '', 0), ('A5', '', 0), ('A6', '', 0), ('A7', '', 0), ('A8', '', 0),
('B1', '', 0), ('B2', '', 0), ('B3', '', 0), ('B4', '', 0), ('B5', '', 0), ('B6', '', 0), ('B7', '', 0), ('B8', '', 0),
('C1', '', 0), ('C2', '', 0), ('C3', '', 0), ('C4', '', 0), ('C5', '', 0), ('C6', '', 0), ('C7', '', 0), ('C8', '', 0),
('D1', '', 0), ('D2', '', 0), ('D3', '', 0), ('D4', '', 0), ('D5', '', 0), ('D6', '', 0), ('D7', '', 0), ('D8', '', 0),
('E1', '', 0), ('E2', '', 0), ('E3', '', 0), ('E4', '', 0), ('E5', '', 0), ('E6', '', 0), ('E7', '', 0), ('E8', '', 0),
('F1', '', 0), ('F2', '', 0), ('F3', '', 0), ('F4', '', 0), ('F5', '', 0), ('F6', '', 0), ('F7', '', 0), ('F8', '', 0);


TRUNCATE TABLE user;